---
kind: property
id: P:Autodesk.Revit.Creation.FamilyInstanceCreationData.RotateAngle
source: html/6f7a1053-085b-e0f5-03db-cb43dab647e8.htm
---
# Autodesk.Revit.Creation.FamilyInstanceCreationData.RotateAngle Property

Get or set the rotate angle of the FamilyInstance

## Syntax (C#)
```csharp
public double RotateAngle { get; set; }
```

## Remarks
The FamilyInstance will rotate this angle when the instance is created.